///-------------------------------------------------------------------
//*
//*	@作成日		2017/08/28
//*
//*	@名前		GameTitle.cpp
//*
//* @役割		ゲームタイトルの処理クラス
//*
//*	@著者		加藤 彰馬
//*
///-------------------------------------------------------------------

// ヘッダのインクルード
#include "pch.h"
#include "Game.h"
#include "GameTitle.h"

// 名前空間
using namespace DirectX;
using namespace DirectX::SimpleMath;



////////////////////////
//* メンバ変数の定義 *//
////////////////////////

////----------------------------------------------------------------------
////! @関数名：GameTitle
////!
////! @役割：タイトルのコンストラクタ
////!
////! @引数：なし(void)
////!
////! @戻り値：存在しない
////----------------------------------------------------------------------
GameTitle::GameTitle()
{
	//Initialize();
}

////----------------------------------------------------------------------
////! @関数名：~GameTitle
////!
////! @役割：タイトルのデストラクタ
////!
////! @引数：存在しない
////!
////! @戻り値：存在しない
////----------------------------------------------------------------------
GameTitle::~GameTitle()
{
	//delete m_keyboard;
}

////----------------------------------------------------------------------
////! @関数名：GameTitle
////!
////! @役割：タイトルの初期化関数
////!
////! @引数：なし(void)
////!
////! @戻り値：なし(void)
////----------------------------------------------------------------------
void GameTitle::Initialize()
{
	////* キーボードの初期化
	//m_keyboard = new Keyboard;

	////* タイトル画像の初期位置
	//m_pos.x = 400.0f;
	//m_pos.y = 300.0f;
}

////----------------------------------------------------------------------
////! @関数名：Update
////!
////! @役割：タイトルの更新関数
////!
////! @引数：なし(void)
////!
////! @戻り値：なし(void)
////----------------------------------------------------------------------
void GameTitle::Update()
{
	//// キーボードの状態取得
	//auto kb = m_keyboard->GetState();

	//// ←キーで左へ
	//if (kb.Space)
	//{
	//	this->~GameTitle();
	//}
}

////----------------------------------------------------------------------
////! @関数名：GameTitle
////!
////! @役割：タイトルの描画関数
////!
////! @引数：なし(void)
////!
////! @戻り値：なし(void)
////----------------------------------------------------------------------
void GameTitle::Render()
{
	////* タイトルの描画
	//Game::m_spriteBatch->Draw(m_title.Get(), m_pos, nullptr, Colors::White,
	//	0.f, m_titleOrigin);
}

////----------------------------------------------------------------------
////! @関数名：GameTitle
////!
////! @役割：タイトルのデータ読み込み関数
////!
////! @引数：なし(void)
////!
////! @戻り値：なし(void)
////----------------------------------------------------------------------
void GameTitle::CreateDevice()
{

	////* タイトルのテクスチャ読み込み
	//DX::ThrowIfFailed(
	//	CreateWICTextureFromFile(m_d3dDevice.Get(), L"Images\\title.png",
	//		resource.GetAddressOf(),
	//		m_title.ReleaseAndGetAddressOf()));

	//ComPtr<ID3D11Texture2D> title;
	//DX::ThrowIfFailed(resource.As(&title));

	//CD3D11_TEXTURE2D_DESC titleDesc;
	//title->GetDesc(&titleDesc);

	//m_titleOrigin.x = float(titleDesc.Width / 2);
	//m_titleOrigin.y = float(titleDesc.Height / 2);
}
